artillery.yml
config:
  target: "https://stresstest-azexewcgg4d5hmed.francecentral-01.azurewebsites.net/"
  phases:
    - duration: 10
      arrivalRate: 5
      name: "Warm up"
    - duration: 15
      arrivalRate: 20
      name: "Charge moyenne"
    - duration: 15
      arrivalRate: 50
      name: "Charge forte"
    - duration: 60
      arrivalRate: 100
      name: "Pic de charge"

scenarios:
  - name: "Stress CPU"
    flow:
      - get:
          url: "/prime?duration=100"